#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/testbuildpleaseignore/testbuildpleaseignore/runs/run-5Ea4AxMHtdLt4XRp

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_ecr_repository.api-ecr: Refreshing state... [id=api]
aws_ecr_repository.web-ecr: Refreshing state... [id=web]
aws_cloudwatch_log_group.api: Refreshing state... [id=/ecs/api]
aws_secretsmanager_secret.pg_password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:621387225812:secret:pg_password-ygBFFN]
aws_cloudwatch_log_group.web: Refreshing state... [id=/ecs/web]
aws_alb.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/web-lb/fbaa5112cdeddfbd]
aws_eip.nat: Refreshing state... [id=eipalloc-0f240680146d7f6c9]
aws_alb.api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/api-lb/973602ee26484c03]
aws_vpc.main: Refreshing state... [id=vpc-04d2251cd6b6fe059]
aws_ecs_cluster.app: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:cluster/app]
aws_iam_role.tbpi_task_execution_role: Refreshing state... [id=tbpi-task-execution-role]
aws_secretsmanager_secret_version.pg_password_value: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:621387225812:secret:pg_password-ygBFFN|03F00597-B501-4F43-B57C-317CAFB6804B]
aws_rds_cluster.postgresql: Refreshing state... [id=aurora-cluster]
aws_subnet.private_d: Refreshing state... [id=subnet-01f4e3ee3d8597354]
aws_subnet.public_e: Refreshing state... [id=subnet-0ababdb621af5bc6a]
aws_subnet.private_c: Refreshing state... [id=subnet-0cb6f889d7740e8e8]
aws_subnet.private_e: Refreshing state... [id=subnet-0576a0d341e031959]
aws_route_table.private: Refreshing state... [id=rtb-06c50b9b738de09c2]
aws_internet_gateway.igw: Refreshing state... [id=igw-0a7d40d7d4e4f8716]
aws_subnet.public_d: Refreshing state... [id=subnet-0f442550635c8cfaa]
aws_route_table.public: Refreshing state... [id=rtb-0ca25eee35bcb3742]
aws_security_group.ingress_api: Refreshing state... [id=sg-0022b382aaa9f8140]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=tbpi-task-execution-role:password-policy-secretsmanager]
aws_security_group.egress_all: Refreshing state... [id=sg-0a72c9346f3703987]
aws_security_group.http: Refreshing state... [id=sg-03b60c884a147a009]
aws_ecs_task_definition.api: Refreshing state... [id=api]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=tbpi-task-execution-role-20220403213404601400000001]
aws_route.public_igw: Refreshing state... [id=r-rtb-0ca25eee35bcb37421080289494]
aws_route_table_association.public_e_subnet: Refreshing state... [id=rtbassoc-0dfd8fb1e86e68a40]
aws_route_table_association.private_d_subnet: Refreshing state... [id=rtbassoc-05912559b388e973c]
aws_route_table_association.private_c_subnet: Refreshing state... [id=rtbassoc-028dfbb4010d4bb03]
aws_nat_gateway.ngw: Refreshing state... [id=nat-0314c755c04f4621c]
aws_route_table_association.private_e_subnet: Refreshing state... [id=rtbassoc-01b48f5d167b4feb5]
aws_route_table_association.public_d_subnet: Refreshing state... [id=rtbassoc-038c27e2ca8931400]
aws_route.private_ngw: Refreshing state... [id=r-rtb-06c50b9b738de09c21080289494]
aws_lb_target_group.api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:targetgroup/api/86c734428b543363]
aws_ecs_task_definition.web: Refreshing state... [id=web]
aws_lb_target_group.web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:targetgroup/web/cfb56f4064bc0dbf]
aws_alb_listener.api_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/api-lb/973602ee26484c03/bdc73bfe1447b582]
aws_ecs_service.api: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:service/app/api]
aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-east-1:621387225812:service/app/web]
aws_alb_listener.web_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/web-lb/fbaa5112cdeddfbd/2e90640bfbb92fbe]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecs_service.api has changed
  ~ resource "aws_ecs_service" "api" {
        id                                 = "arn:aws:ecs:us-east-1:621387225812:service/app/api"
        name                               = "api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:621387225812:task-definition/api:6" -> "arn:aws:ecs:us-east-1:621387225812:task-definition/api:11"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.web has changed
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-east-1:621387225812:service/app/web"
        name                               = "web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:621387225812:task-definition/web:6" -> "arn:aws:ecs:us-east-1:621387225812:task-definition/web:10"
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.api has changed
  ~ resource "aws_ecs_task_definition" "api" {
        id                       = "api"
      + tags                     = {}
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_alb.alb will be created
  + resource "aws_alb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = [
          + "sg-0022b382aaa9f8140",
          + "sg-0a72c9346f3703987",
        ]
      + subnets                    = [
          + "subnet-0ababdb621af5bc6a",
          + "subnet-0f442550635c8cfaa",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_alb.api will be destroyed
  # (because aws_alb.api is not in configuration)
  - resource "aws_alb" "api" {
      - arn                        = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/api-lb/973602ee26484c03" -> null
      - arn_suffix                 = "app/api-lb/973602ee26484c03" -> null
      - desync_mitigation_mode     = "defensive" -> null
      - dns_name                   = "api-lb-675795043.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = false -> null
      - enable_http2               = true -> null
      - enable_waf_fail_open       = false -> null
      - id                         = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/api-lb/973602ee26484c03" -> null
      - idle_timeout               = 60 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "api-lb" -> null
      - security_groups            = [
          - "sg-0022b382aaa9f8140",
          - "sg-0a72c9346f3703987",
        ] -> null
      - subnets                    = [
          - "subnet-0ababdb621af5bc6a",
          - "subnet-0f442550635c8cfaa",
        ] -> null
      - tags                       = {} -> null
      - tags_all                   = {} -> null
      - vpc_id                     = "vpc-04d2251cd6b6fe059" -> null
      - zone_id                    = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0ababdb621af5bc6a" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0f442550635c8cfaa" -> null
        }
    }

  # aws_alb.web will be destroyed
  # (because aws_alb.web is not in configuration)
  - resource "aws_alb" "web" {
      - arn                        = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/web-lb/fbaa5112cdeddfbd" -> null
      - arn_suffix                 = "app/web-lb/fbaa5112cdeddfbd" -> null
      - desync_mitigation_mode     = "defensive" -> null
      - dns_name                   = "web-lb-716628114.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = false -> null
      - enable_http2               = true -> null
      - enable_waf_fail_open       = false -> null
      - id                         = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/web-lb/fbaa5112cdeddfbd" -> null
      - idle_timeout               = 60 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "web-lb" -> null
      - security_groups            = [
          - "sg-03b60c884a147a009",
          - "sg-0a72c9346f3703987",
        ] -> null
      - subnets                    = [
          - "subnet-0ababdb621af5bc6a",
          - "subnet-0f442550635c8cfaa",
        ] -> null
      - tags                       = {} -> null
      - tags_all                   = {} -> null
      - vpc_id                     = "vpc-04d2251cd6b6fe059" -> null
      - zone_id                    = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0ababdb621af5bc6a" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0f442550635c8cfaa" -> null
        }
    }

  # aws_alb_listener.api_http must be replaced
-/+ resource "aws_alb_listener" "api_http" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/api-lb/973602ee26484c03/bdc73bfe1447b582" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/api-lb/973602ee26484c03/bdc73bfe1447b582" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/api-lb/973602ee26484c03" -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_alb_listener.web_http must be replaced
-/+ resource "aws_alb_listener" "web_http" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/web-lb/fbaa5112cdeddfbd/2e90640bfbb92fbe" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:621387225812:listener/app/web-lb/fbaa5112cdeddfbd/2e90640bfbb92fbe" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:621387225812:loadbalancer/app/web-lb/fbaa5112cdeddfbd" -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_ecs_task_definition.web must be replaced
-/+ resource "aws_ecs_task_definition" "web" {
      ~ arn                      = "arn:aws:ecs:us-east-1:621387225812:task-definition/web:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "API_HOST"
                          - value = "http://api-lb-675795043.us-east-1.elb.amazonaws.com"
                        },
                    ]
                  - essential        = true
                  - image            = "621387225812.dkr.ecr.us-east-1.amazonaws.com/web:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "web"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "web" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ api_alb_url = "http://api-lb-675795043.us-east-1.elb.amazonaws.com" -> (known after apply)
  ~ web_alb_url = "http://web-lb-716628114.us-east-1.elb.amazonaws.com" -> (known after apply)

```

</details>

*Pusher: @bdharris08, Action: `pull_request`*